Repository: Ingwie/OpenAVRc_Dev
Catalog: OpenAVRc_Desktop/po/OpenAVRc_DesktopCZ.po
Languages: cs_cz

source: Encodeur ŕ 0
cs_cz: Enkodér na 0

source: GPLv2 . Firmware basé sur NextStepRc 2.18
cs_cz: GPLv2 Firmware založený na NextStepRc 2.18

source: Opération annulée Cette opération nécessite un port COM.
cs_cz: Operace byla zrušena Tato operace vyžaduje COM port

source: 3POS
cs_cz: 3 pólový

source: : Il y a au moins ce nom avec des caractčres spéciaux non autorisés. Veuillez le changer. Caractčres spéciaux autorisés : _-+:*=?
cs_cz: Existuje jedno jméno s nepovolenými speciálními znaky ! Prosím opravte to. Povolené speciální znaky : _- +: * =?

source: : Il y a au moins ce nom répété , veuillez le changer.
cs_cz: Opakuje se jedno jméno ! Změňte jej

source: : Il y a au moins ce nom trop court, veuillez le compléter.
cs_cz: Jedno jméno je příliš krátké ! Vyplňte jej

source: A propos F1
cs_cz: O programu F1

source: ACCURAT_THROTTLE_STATS
cs_cz: Přesné statistiky plynu

source: ARITHMETIC_OVERFLOW_CHECK
cs_cz: Aritmetická kontrola překročení

source: AUTOSOURCE
cs_cz: Auto knipl

source: AUTOSWITCH
cs_cz: Auto spínač

source: Affichage des valeurs des voies en % ou uS
cs_cz: Možnost zobrazení hodnot kanálu v % nebo μs. Poznámka : V % 0-100 můžete určit desetinnou číslici 0 nebo 1

source: Affichage graphique de l'état de la batterie
cs_cz: Možnost grafického zobrazení stavu baterie

source: Affiche une mini barre pour visualiser une sauvegarde en cours
cs_cz: Ukazatel zobrazení průběhu zálohování eeprom. V pravém horním rohu displeje se zobrazí malý ukazatel průběhu uložení parametrů do paměti. Důrazně doporučujeme !

source: Aide
cs_cz: Nápověda

source: Ajoute du code pour prčvoir débordement aritmethique
cs_cz: Zabrání aritmetickému překročení

source: Ajoute la fonction spéciale "Remplacer CHx"
cs_cz: Přidá speciální funkci "Nahradit CHx"

source: Annonces vocales
cs_cz: Hlasové zprávy

source: Annuler
cs_cz: Zrušit

source: Appelation de la nouvelle configuration
cs_cz: Nový název profilu rádia

source: Attention : Tous ce qui n'est pas blanc sera converti en noir
cs_cz: Upozornění : Všechny pixely, které nejsou bílé, zčernají

source: Audio
cs_cz: Zvuk

source: Auto Detection
cs_cz: Automatická detekce

source: Auto detection des manches lors de la programmatiion
cs_cz: Automatická detekce polohy kniplů během programování

source: Auto detection des switchs lors de la programmatiion
cs_cz: Automatická detekce spínačů během programování

source: Autres links
cs_cz: Ostatní odkazy

source: Autres options
cs_cz: Ostatní možnosti

source: Autres paramčtres
cs_cz: Ostatní možnosti

source: Avez vous une carte SD de sauvegarde ? Insérez la avant de cliquer sur OUI
cs_cz: Máte záložní SD kartu ? Vložte ji před kliknutím na "ANO"

source: Batt graph
cs_cz: Bateriový graf

source: Bold
cs_cz: Tučné písmo

source: Branchez votre radio
cs_cz: Připojte rádio k PC

source: CORRECT_NEGATIVE_VALUES
cs_cz: Přesné negativní hodnoty

source: Carte SD
cs_cz: SD karta

source: Change les trim de la main droite ŕ la main gauche, et vice-versa
cs_cz: Zaměnit pravé trimy na levé a obráceně

source: Charger la configuration
cs_cz: Načíst aktivní profil rádia

source: Choisir le fichier (.bin) pour transferer les modęles ŕ la radio.
cs_cz: Vybrat soubor (.bin) pro export nastavení a modelů do rádia

source: Choisir le fichier pour importer le Firmware des la radio.
cs_cz: Vybrat soubor (.hex) pro import firmwaru z rádia

source: Choisir le fichier pour importer les modčles des la radio.
cs_cz: Vybrat soubor (.bin) pro import nastavení a modelů z rádia

source: Choisir le fichier pour transferer le Firmware ŕ la radio.
cs_cz: Vybrat soubor (.hex) pro export firmwaru do rádia

source: Choisissez la carte SD de sauvegarde de la radio
cs_cz: Vybrat záložní SD kartu rádia

source: Choisissez la langue des mensages vocales
cs_cz: Vybrat jazyk hlasu

source: Choisissez votre moteur de synthčse vocale
cs_cz: Vybrat hlas syntézy převodu textu na řeč

source: Communication avec la radio
cs_cz: Komunikace s rádiem

source: Compilateur
cs_cz: Kompilátor

source: Compiler
cs_cz: Kompilovat

source: Configuration
cs_cz: Profily rádia

source: Copie en cours, attendez SVP......
cs_cz: Probíhá kopírování, počkejte prosím ......

source: Curves
cs_cz: Křivky

source: Defaut ne peut ętre effacé
cs_cz: Výchozí nelze odstranit !

source: Detection
cs_cz: Detekce

source: Documentation en ligne
cs_cz: Dokumentace online

source: Double click pour éditer.
cs_cz: Dvojitým kliknutím upravte

source: Double keys
cs_cz: Dvojité klávesy

source: Débrancher la radio du PC
cs_cz: Odpojte rádio od PC

source: Défaut
cs_cz: Výchozí

source: EXTRA 3POS
cs_cz: Extra 3póly

source: Ecran d'accueil
cs_cz: Úvodní obrazovka

source: Emplacement d'AVRDUDE
cs_cz: Umístění Avrdude

source: Empčche la synthčse vocale de dire "et". Exemple : entre minutes "et" seconde
cs_cz: Vyhýbá se zbytečným „a“. Např. mezi minutami "a" sekundami při ohlášení času. Není to nutné s kartou JQ6500

source: EncodeurA
cs_cz: Enkodér A

source: EncodeurB
cs_cz: Enkodér B

source: Extra 3POS
cs_cz: Extra 3póly

source: Fichier
cs_cz: Soubor

source: Fichier image
cs_cz: Soubor obrázku

source: Fichiers Voix
cs_cz: Soubory hlasu

source: Flight modes
cs_cz: Letové režimy

source: Font
cs_cz: Písmo

source: Fusibles et Bootloader
cs_cz: Pojistky a zavaděč

source: Global vars
cs_cz: Globální proměnné

source: Générer ce fichier
cs_cz: Vytvořit tento soubor

source: Générer tout
cs_cz: Generovat vše

source: HELI
cs_cz: Helikoptéra

source: Haptic
cs_cz: Vibrace

source: Il est recommande de sauvegarder vos modeles avant, voulez vous continuer ?
cs_cz: Doporučuji nejdříve uložit modely, chcete pokračovat ?

source: Inter1
cs_cz: Spínač 1

source: Inter2
cs_cz: Spínač 2

source: Inter3
cs_cz: Spínač 3

source: Inter4
cs_cz: Spínač 4

source: Inter5
cs_cz: Spínač 5

source: Inter6
cs_cz: Spínač 6

source: Interface
cs_cz: Rozhraní

source: Inversion Stick_LH
cs_cz: Inverze kniplu LH

source: Inversion Stick_LV
cs_cz: Inverze kniplu LV

source: Inversion Stick_RH
cs_cz: Inverze kniplu RH

source: Inversion Stick_RV
cs_cz: Inverze kniplu RV

source: JQ6500 PCB (by Pyrall)
cs_cz: JQ6500 PCB (podle Pyrall)

source: Jouer
cs_cz: Přehrát

source: La carte SD doit avoir été formatée pour un bon fonctionnement sur la radio
cs_cz: SD karta musí být naformátována pro kvalitní provoz rádia

source: Langue
cs_cz: Jazyk

source: Langue affichée
cs_cz: Zobrazený jazyk firmwaru

source: Langue de la synthése vocale
cs_cz: Jazyk hlasové syntézy

source: Langue voice
cs_cz: Jazyk hlasu

source: Lire le firmware de la radio
cs_cz: Číst firmware z rádia

source: Lire les réglages et les modčles de la radio (eeprom)
cs_cz: Číst nastavení a modely z rádia (eeprom)

source: Lire/Écrire
cs_cz: Čtení/Zápis

source: Logiciel pour la personnalisation, la compilation, le flashage, la sauvegarde de votre radio OpenAVRc
cs_cz: Software pro přizpůsobení, kompilaci, flashování a zálohu vašeho OpenAVRc rádia

source: MULTI
cs_cz: MULTI serial

source: Manches
cs_cz: Kniply

source: Matériel
cs_cz: Hardware

source: Mauvais type de radio selectionné
cs_cz: Nesprávný výběr rádia !

source: Merci de vérifier les paramčtres
cs_cz: Zkontrolujte prosím nastavení

source: Mode
cs_cz: Mód

source: Mode de la radio
cs_cz: Mód rádia. Například : 1 (SVPK) plyn na pravé ruce

source: Mégamini schema
cs_cz: Schéma Megamini

source: Mégamini shield
cs_cz: Štít Megamini

source: NOANDSECONDE
cs_cz: Žádné "a"

source: Navigation
cs_cz: Navigace

source: Nom
cs_cz: Název

source: Nom des interrupteurs
cs_cz: Názvy spínačů

source: Nombre d'instances
cs_cz: Počet případů

source: Non compatible avec AUTOSOURCE. AUTOSOURCE décoché.
cs_cz: Není kompatibilní s funkcí "Auto knipl", funkce je zakázána

source: Non compatible avec NAVIGATION = STICKS
cs_cz: Není kompatibilní s funkcí "Navigace = Kniply"

source: Non compatible avec TELEMETRY = STD.
cs_cz: Není kompatibilní s funkcí "Telemetrie = STD"

source: Nouvelle configuration
cs_cz: Nový profil rádia

source: OpenAVRc Manual (JPZ)
cs_cz: Manuál OpenAVRc (JPZ)

source: Option Vibreur
cs_cz: Možnost vibrací

source: Option ajuster le gain fonction du subtrim
cs_cz: Přidá nastavení pro úpravu tahu serva symetricky. Doporučeno !

source: Option annonces vocales
cs_cz: Možnost hlasových oznámení

source: Option audio
cs_cz: Možnost zvuku

source: Option carte SD (Sauvegarde - Fichiers log)
cs_cz: Možnost SD karty (záloha - záznam do souborů)

source: Option courbes
cs_cz: Možnost aktivovat nastavení křivek

source: Option hélicoptčre
cs_cz: Zahrnuje další obrazovku s funkcemi a mixéry pro snadnější nastavení helikoptéry

source: Option modčles pré programmés
cs_cz: Zahrnuje obrazovku s předprogramovanými standardními šablonami nastavení modelů, které lze použít při vytváření nového modelu. Velmi praktické ! V pozici 07 najdete také servo tester, velmi užitečné

source: Option phases de vol
cs_cz: Možnost šesti letových režimů, které odpovídají šesti různým pamětím modelu. Důrazně doporučuji v kombinaci s proměnnými GV

source: Option réglage des neutres indépendant
cs_cz: Přidejte nastavení umožňující neutrál serva bez ovlivnění jejich tahů. Doporučeno !

source: Option variables globales
cs_cz: Přidá globální proměnné VG1 do VG12, lze použít jako náhradu za nastavení jednotlivých číselných parametrů, například % z dvojitého pohybu atd. Časem se stává nepostradatelným ve spojení s letovými režimy

source: Options avancées
cs_cz: Pokročilé možnosti

source: Override channel function
cs_cz: Nahradit funkci kanálu

source: PA Gain (DB)
cs_cz: PA zisk (dB)

source: PERSONAMES
cs_cz: Vlastní názvy spínačů

source: PPM Center adjust
cs_cz: PPM neutrál

source: PPM Simm limits
cs_cz: PPM symetricky

source: PWM_BACKLIGHT
cs_cz: PWM podsvícení LCD

source: Par défaut
cs_cz: Výchozí

source: Paramčtres
cs_cz: Nastavení

source: Paramčtres de communication avec la radio
cs_cz: Nastavení programu pro komunikaci s rádiem

source: Personnalisation
cs_cz: Přizpůsobení

source: Personnaliser
cs_cz: Změnit

source: Peut remplacer les boutons de navigation
cs_cz: Možnost nahradit navigační tlačítka

source: Police de caractére
cs_cz: Možnost formátu písma

source: Pour changer les messages
cs_cz: Změnit zprávy

source: Pour les compétitions
cs_cz: Možnost speciálního režimu pro soutěže. Funkce Varia je vypnuta, zapnuta nebo možnost volby

source: Processeur
cs_cz: Procesor

source: Programmateur
cs_cz: Programátor

source: Programmation des fusibles
cs_cz: Programování pojistek

source: Programmation du Bootloader
cs_cz: Programování zavaděče

source: Programmeur :
cs_cz: Programátor :

source: Protocole
cs_cz: Protokol

source: Protocole MULTI
cs_cz: Možnost multiprotocolu v sériové komunikaci. Více na : https://github.com/pascallanger/DIY-Multiprotocol-TX-Module

source: Protocole PPM 8 ŕ 16 voies
cs_cz: PPM protokol 8 až 16 kanálů

source: Protocole SPI RF
cs_cz: SPI RF protokol

source: Protocoles DSM ..
cs_cz: DSM2 serial pro Spektrum RX

source: Quitter Alt-F4
cs_cz: Ukončit Alt+F4

source: Quitter l'application
cs_cz: Ukončit aplikaci

source: Raccourcis avec deux touches pour passer une valeur ŕ min/max/0
cs_cz: Urychluje zadávání číselných hodnot (například +100 nebo -100) pomocí kombinace dvou kláves

source: Restaurer l'écran par défaut
cs_cz: Obnovit výchozí úvodní obrazovku

source: Référence de l'écran
cs_cz: Typ LCD displeje

source: Réglages
cs_cz: Nastavení

source: Répertoire de avrdude
cs_cz: Adresář Avrdude

source: SD DATA
cs_cz: SD karta

source: SD VOICE
cs_cz: Soubory hlasu SD karty

source: SHUTDOWN_CONFIRMATION
cs_cz: Obrazovka potvrzení vypnutí

source: SIMULATEUR F-RAM
cs_cz: F-RAM SIMULÁTOR

source: SIMULATEUR STANDARD
cs_cz: STANDARDNÍ SIMULÁTOR

source: Sauvegarder et quitter
cs_cz: Uložit a ukončit

source: Sauvegarder et sortir
cs_cz: Uložit a ukončit

source: Sauvegarder réglage
cs_cz: Uložit nastavení

source: Selection du potentiomčtre utilisé pour XD0
cs_cz: Možnost potenciometru použitého pro spínač "Extra 3póly - XD0"

source: Selectionnez le lecteur
cs_cz: Vybrat jednotku

source: Supprimer
cs_cz: Odstranit profil

source: Supprimer la configuration active
cs_cz: Odstranit aktivní profil rádia

source: Symétrise les valeurs affichées
cs_cz: Vyvážení zobrazených hodnot

source: Synthčse vocale
cs_cz: Hlasová syntéza

source: Sűr? Vous voulez continuer?
cs_cz: Opravdu chcete pokračovat ?

source: TEMPLATES
cs_cz: Šablony

source: Terminé !
cs_cz: Dokončeno !

source: Toggle trims
cs_cz: Zaměnit trimy

source: Type de radio
cs_cz: Typ rádia

source: Télemetrie
cs_cz: Telemetrie

source: Télémétrie installée
cs_cz: Možnost telemetrie FRSKY byla testována a ověřena pomocí FrSky FSH01 hubu, přijímače DIY, F802 D8, FrSky X, FrSky S-port. Pro telemetrii FRSKY v PPM vyžaduje převodník RS/TTL nebo hardwarové modifikace. STD = bez telemetrie. Tento režim zakáže všechny možnosti pod touto nabídkou

source: Unitées
cs_cz: Možnost metrických nebo imperiálních(anglických) jednotek

source: Unités
cs_cz: Jednotky

source: Utilisation d'une eeprom externe : FM24W256
cs_cz: Možnost použití externího eepromu FM24W256. Arduino eeprom je nahrazena pamětí F-Ram o velikosti 32 kB. Nezapomeňte v kompilátoru vybrat rádio m2560Fram

source: VOICE/AUDIO PCB et RTC (by Pyrall)
cs_cz: Hlas/audio PCB a RTC (podle Pyrall)

source: Valider
cs_cz: Potvrdit

source: Voice
cs_cz: Hlas

source: Voix
cs_cz: Editor souborů hlasu

source: Voulez vous copier les fichiers sur la carte du JQ ? Insérez la avant de cliquer sur OUI
cs_cz: Chcete zkopírovat soubory na kartu JQ ? Vložte ji před kliknutím na "ANO"

source: Vrai police en gras
cs_cz: Možnost tučného písma při nastavení mixérů, spínačů a dalších aktivních prvků, které pomáhají lépe vizualizovat stavy proměnných

source: WS HowHigh Altimeter
cs_cz: Možnost pokud používáte vysoce přesné vario

source: WS_HOW_HIGH
cs_cz: Vys. přesné vario

source: X-Any Options
cs_cz: Možnosti X-Any

source: non défini
cs_cz: není definovaný

source: Écran d'accueil
cs_cz: Úvodní obrazovka

source: Écrire le bootloader
cs_cz: Zapsat zavaděč

source: Écrire le bootloader F-RAM
cs_cz: Zapsat zavaděč F-Ram

source: Écrire le firmware dans la radio
cs_cz: Zapsat firmware do rádia

source: Écrire les fusibles
cs_cz: Zapsat pojistky

source: Écrire les réglages et les modčles dans la radio (eeprom)
cs_cz: Zapsat nastavení a modely do rádia (eeprom)

source: Écriture dans la carte SD
cs_cz: Zápis na SD kartu

source: Éditeur
cs_cz: Editor

source: Ajout de fonctions sans fils
cs_cz: Možnost bezdrátových funkcí

source: Transfert de données
cs_cz: Přenos dat Xmodemu

source: Rotation Lcd 180°
cs_cz: Otočit lcd o 180°

source: Communication
cs_cz: Komunikace

source: Mémoire libre :
cs_cz: Volná paměť :

source: Reboot
cs_cz: Restartujte

source: Local
cs_cz: Místní
